const state = {
  products: [
    {
      category: "Горки",
      name: "004202 - Горка «Мини»",
      imagesPath: [
        "@/assets/img/products/slides/004202/1.png",
        "@/assets/img/products/slides/004202/2.png",
        "@/assets/img/products/slides/004202/3.png",
        "@/assets/img/products/slides/004202/4.jpg",
        "@/assets/img/products/slides/004202/5.jpg",
        "@/assets/img/products/slides/004202/6.jpg",
        "@/assets/img/products/slides/004202/7.jpg",
        "@/assets/img/products/slides/004202/8.jpg",
      ],
      price: "0",
      description: `Детское игровое оборудование «Горка» является одним из обязательных  и востребованных элементов детской игровой площадки и  представляет собой модульную конструкцию с высотой стартовой площадки от 600 мм. до 2000 мм. в зависимости от возрастной группы детей. Горки могут быть изготовлены в виде стандартной модели или стилизованы в виде различных животных, рыб, сказочных персонажей, машинок и  т.д.  Конструкция горок состоит из основных элементов: борта, стартовый участок, ступеньки, стартовая площадка и скат горки. Скат горки может быть изготовлен из единого листа нержавеющей стали толщиной 1,5 мм. или из специального пластика с добавлением антистатического компонента. По требованиям безопасности, на уличных детских площадках запрещены скаты горок, изготовленные из стеклопластика, который в процессе  эксплуатации слоится и может тяжело травмировать ребенка при спуске. Скат горки, в зависимости от высоты, может иметь от одного до нескольких участков торможения скольжения. Скаты горок по форме могут быть фигурные, прямые, тоннельные, спиральные.   Все горки должны иметь стартовый участок с металлической перекладиной, которая заставляет ребенка сесть и препятствует падению ребенка (если его  толкут сзади), участок скольжения и конечный участок торможения. Наличие конечного участка торможения позволяет ребенку избежать прямого скоростного удара  стопами ног с основанием площадки. Фанера должна быть тщательно обработана, загрунтована и окрашена, а также исключать любую возможность получения детьми заноз, порезов и других травм. При установке, горки подлежат обязательному бетонированию. При установке горки необходимо соблюдать рекомендуемые зоны безопасности – это свободное пространство вокруг горки. Поперечный размер поручней, перекладин и рукояток в любом направлении должен быть не менее 16 мм., но не более 45 мм. Конструкция не должна включать в себя «V»– образных зазоров и щелей, имеет плавные радиусы и тщательную обработку сварных швов. Все места креплений резьбовых соединений должны быть закрыты пластиковыми заглушками. 

        Конструкция поверхности горок должна исключать возможность застревания тела, частей тела и одежды ребенка. Горки торговой марки «КСИЛ» соответствуют международному стандарту безопасности EN 1176,  антивандальны, имеют Сертификат Соответствия Государственной Системы Технического Регулирования  Республики Казахстан, Экспертное заключение Федеральной Службы по надзору в сфере защиты прав потребителей и благополучия человека РФ, Сертификаты Соответствия ГОСТ РФ и паспорт (на казахском и русском языках), сопровождаются этикеткой с информацией  для потребителя (на казахском и русском языках). `
    },
    {
      category: "Горки",
      name: "004206 - Горка «Дино»",
      imagesPath: [
        "@/assets/img/products/slides/004206/1.png",
        "@/assets/img/products/slides/004206/2.png",
        "@/assets/img/products/slides/004206/3.jpg",
        "@/assets/img/products/slides/004206/4.jpg",
        "@/assets/img/products/slides/004206/5.jpg",
        "@/assets/img/products/slides/004206/6.jpg",
        "@/assets/img/products/slides/004206/7.jpg",
      ],
      price: "0",
      description: `Детское игровое оборудование «Горка» является одним из обязательных  и востребованных элементов детской игровой площадки и  представляет собой модульную конструкцию с высотой стартовой площадки от 600 мм. до 2000 мм. в зависимости от возрастной группы детей. Горки могут быть изготовлены в виде стандартной модели или стилизованы в виде различных животных, рыб, сказочных персонажей, машинок и  т.д.  Конструкция горок состоит из основных элементов: борта, стартовый участок, ступеньки, стартовая площадка и скат горки. Скат горки может быть изготовлен из единого листа нержавеющей стали толщиной 1,5 мм. или из специального пластика с добавлением антистатического компонента. По требованиям безопасности, на уличных детских площадках запрещены скаты горок, изготовленные из стеклопластика, который в процессе  эксплуатации слоится и может тяжело травмировать ребенка при спуске. Скат горки, в зависимости от высоты, может иметь от одного до нескольких участков торможения скольжения. Скаты горок по форме могут быть фигурные, прямые, тоннельные, спиральные.   Все горки должны иметь стартовый участок с металлической перекладиной, которая заставляет ребенка сесть и препятствует падению ребенка (если его  толкут сзади), участок скольжения и конечный участок торможения. Наличие конечного участка торможения позволяет ребенку избежать прямого скоростного удара  стопами ног с основанием площадки. Фанера должна быть тщательно обработана, загрунтована и окрашена, а также исключать любую возможность получения детьми заноз, порезов и других травм. При установке, горки подлежат обязательному бетонированию. При установке горки необходимо соблюдать рекомендуемые зоны безопасности – это свободное пространство вокруг горки. Поперечный размер поручней, перекладин и рукояток в любом направлении должен быть не менее 16 мм., но не более 45 мм. Конструкция не должна включать в себя «V»– образных зазоров и щелей, имеет плавные радиусы и тщательную обработку сварных швов. Все места креплений резьбовых соединений должны быть закрыты пластиковыми заглушками. 

      Конструкция поверхности горок должна исключать возможность застревания тела, частей тела и одежды ребенка. Горки торговой марки «КСИЛ» соответствуют международному стандарту безопасности EN 1176,  антивандальны, имеют Сертификат Соответствия Государственной Системы Технического Регулирования  Республики Казахстан, Экспертное заключение Федеральной Службы по надзору в сфере защиты прав потребителей и благополучия человека РФ, Сертификаты Соответствия ГОСТ РФ и паспорт (на казахском и русском языках), сопровождаются этикеткой с информацией  для потребителя (на казахском и русском языках). `
    },
  ]
}
const getters = {
  products(state) {
    return state.products;
  },
  productsByCategory: (state, getters) => (category) => {
    console.log('getter');
    let productsByCategory = [];
    for(let product of getters.products) {
      if(product.category === category) {
        productsByCategory.push(product);
      }
    }
    return productsByCategory;
  }

}
const mutations = {}
const actions = {}

export default {
  state,
  getters,
  mutations,
  actions,
}