<template>
  <div class="container about-us-section about-us-section__container">
    <h2 class="about-us-section__title">О НАС</h2>
    <div class="about-us-section__content-wrapper">
      <p class="about-us-section__description">
        Игровое и спортивное оборудование для детских площадок - специализация компании КСИЛ-ТАШКЕНТ в Узбекистане.
        На нашем сайте представлены: горки, карусели, качели, балансиры, качалки, игровые комплексы.
        Сегодня «КСИЛ» — это крупнейшее российское предприятие в области изготовления оборудования детских игровых комплексов и садово-парковой мебели, включающее в свою структуру разработку, все этапы производства и обслуживание.
        Сфера деятельности компании «КСИЛ» простирается от Атлантики до Тихого океана и охватывает более 20 стран мира.
      </p>
      <div class="about-us-section__media-information"></div>
    </div>
  </div>
</template>

<script></script>